home/dotfiles/.config/emacs/README.org

[[*Introduction and remarks][Introduction and remarks]]
[[*General setup][General setup]]
[[*Keybindings][Keybindings]]
- [[*General keybindings][General keybindings]]
- [[*Whichkey][Whichkey]]
[[*Save last session with desktop-package][Save last session with desktop-package]]
[[*UI][UI]]
- [[*Set fonts and font size][Set fonts and font size]]
- [[*Theme][Theme]]
  - [[*Wombat][Wombat]]
  - [[*Catppuccin][Catppuccin]]
  - [[*Spacemacs][Spacemacs]]
- [[*Custom modeline][Custom modeline]]
- [[*Doom-modeline][Doom-modeline]]
- [[*Nerd-icons][Nerd-icons]]
[[*Completion][Completion]]
- [[*Minibuffer][Minibuffer]]
- [[*Without plugins][Without plugins]]
  - [[*Vertico][Vertico]]
  - [[*Orderless][Orderless]]
  - [[*Marginalia][Marginalia]]
- [[*Autosuggestions][Autosuggestions]]
  - [[*yasnippets][yasnippets]]
  - [[*Company][Company]]
[[*Consult][Consult]]
[[*LSP][LSP]]
- [[*eglot][eglot]]
- [[*go mode][go mode]]
- [[*rust mode][rust mode]]
[[*Orgmode and org agenda][Orgmode and org agenda]]
[[*Custom functions][Custom functions]]
[[*Evil-mode][Evil-mode]]

* TODOs
  - [ ] nerd-icons --> disabled for now
  - [X] eglot
  - [X] vertico --> disabled
  - [X] marginalia
  - [X] orderless  --> disabled
  - [X] doom-modeline
    - [X] spacemacs and catppuccin
  - [X] evil and evil-collection
  - [X] snippets
  - [X] go mode
  - [X] rust mode
  - [X] company
  - [X] consult --> disabled
  - [ ] org-superstar? --> don't use for now
  - [X] which-key --> disabled
  
* Introduction and remarks
To further reduce the used plugins, disable marginalia, vertico and orderless but enable the pluginless minibuffer block.
Which-key is only required if keyboard shortcuts should be shown while typing.
If a language server is not required, disable eglot, snippets, go-mode and rust-mode and company.
Disable evil to disable vim keybindings.

The following packages need to be enabled so that evil-collection can be installed. Additionally, evil has an error in emacs 29 with the version available on elpa
#+begin_src emacs-lisp :tangle ~/.config/emacs/init.el
  (require 'package)
  (add-to-list 'package-archives '("gnu" . "https://elpa.gnu.org/packages/") t)
    (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
#+end_src

#+begin_src emacs-lisp :tangle ~/.config/emacs/init.el
  (add-to-list 'load-path "/usr/share/emacs/site-lisp")
  (add-to-list 'load-path "~/.config/emacs/site-lisp")
#+end_src

** Interesting functions in emacs
- compile: enter a function like go test, cargo build etc., view the result in a new buffer and jump to error is one was found --> no lsp necessary ?!
- duplicate-line: copy the current line to the next line.
- M-DEL: delete previous word
- M-d: delete next word

* General setup
#+begin_src emacs-lisp :tangle ~/.config/emacs/init.el
  (setq inhibit-startup-screen t)   ;; Disable the welcome screen
  (tool-bar-mode -1)   	            ;; Disable the toolbar
  (menu-bar-mode -1)                ;; Disable the menu bar
  (scroll-bar-mode -1)              ;; Disable visible scrollbar

  ;; Remember recently edited files. Can then be shown with recentf-open-files
  (recentf-mode 1)

  ;; Save what you enter into minibuffer prompts
  (setq history-length 25)
  (savehist-mode 1)

  ;; Remember and restore the last cursor location of opened files
  (save-place-mode 1)

  ;; show relative line numbers
  (menu-bar--display-line-numbers-mode-relative)

  ;; automatically close brackets
  (electric-pair-mode 1)

  ;; disable sound
  (setq ring-bell-function 'ignore)
  
#+end_src
** My custom functions
#+begin_src emacs-lisp :tangle ~/.config/emacs/init.el
 ;; (require 'nomispaz)
#+end_src
* Keybindings
** General keybindings
#+begin_src emacs-lisp :tangle ~/.config/emacs/init.el
    (global-set-key (kbd "C-+") 'text-scale-increase)                ;; zoom in
    (global-set-key (kbd "C--") 'text-scale-decrease)                ;; zoom out
    (global-set-key (kbd "<C-wheel-up>") 'text-scale-increase)       ;; zoom in with mouse wheel
    (global-set-key (kbd "<C-wheel-down>") 'text-scale-decrease)     ;; zoom out with mouse wheel
  ;;copy link anker to clipboard, insert with C-c C-l
  (global-set-key (kbd "C-c l") 'org-store-link)
  ;; duplicate current line
 ;; first unbind the C-, map in orgmode, then redefine the keymap
  (with-eval-after-load 'org
     (define-key org-mode-map (kbd "C-,") nil))

  (global-set-key (kbd "C-,") 'duplicate-line)
#+end_src
** Whichkey
#+begin_src emacs-lisp :tangle no
  (use-package which-key
    :ensure t
    :init
    (which-key-mode 1)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.3)
    (setq which-key-allow-evil-operators t)
    )
#+end_src
* Save last session with desktop-package
#+begin_src emacs-lisp :tangle ~/.config/emacs/init.el
  (require 'desktop)
    (desktop-save-mode 1)
     ;; don't save the following buffers
     (add-to-list 'desktop-modes-not-to-save 'dired-mode)
     (add-to-list 'desktop-modes-not-to-save 'Info-mode)
     (add-to-list 'desktop-modes-not-to-save 'info-lookup-mode)
     (add-to-list 'desktop-modes-not-to-save 'fundamental-mode)
     ;; specify dir to save session
     (setq desktop-dirname "~/.local/share/emacs/emacs_session_backup")
     (setq desktop-base-file-name "desktop")
     (setq desktop-base-lock-name "desktop.lock")
#+end_src
* UI
** Set fonts and font size
#+begin_src emacs-lisp :tangle ~/.config/emacs/init.el
  (set-face-attribute 'default nil :font "DejaVu Sans Mono" :height 180)
  (set-face-attribute 'fixed-pitch nil :font "DejaVu Sans Mono" :height 180)
  (set-face-attribute 'variable-pitch nil :font "DejaVu Sans" :height 180)

  (set-face-attribute 'mouse nil :background "white")
#+end_src
** Theme
*** Wombat
#+begin_src emacs-lisp :tangle no
(load-theme 'wombat)
#+end_src
*** Catppuccin
#+begin_src emacs-lisp :tangle ~/.config/emacs/init.el
  (require 'catppuccin-theme)
 (load-theme 'catppuccin :no-confirm)
#+end_src
*** Spacemacs
#+begin_src emacs-lisp :tangle no
  (require 'spacemacs-theme)
 (load-theme 'spacemacs-dark :no-confirm)
#+end_src
** Modeline
*** Custom modeline v1
#+begin_src emacs-lisp :tangle no
 (defun custom-evil-mode-indicator ()
  "Display a single-letter Evil mode indicator, or 'E' if Evil mode is inactive."
  (if (bound-and-true-p evil-local-mode)
      (let ((state (substring (symbol-name evil-state) 0 1)))
        (capitalize state))
    "E")) ;; "E" for Emacs mode when Evil is inactive

(defun custom-buffer-name ()
  "Display the name of the current buffer."
  (buffer-name))

(defun custom-line-number ()
  "Display the current line number."
  (format "L%d" (line-number-at-pos)))

(defun custom-mode-indicators ()
  "Display the major mode and selected minor modes in the mode line, each with a custom click function."
  (let* ((modes
          `((major-mode ,(format-mode-line mode-name) ignore)
            (yas-minor-mode "Yasnippet" yas-global-mode)
            (flymake-mode "Flymake" flymake-show-diagnostics-buffer)
            (go-mode "Go Mode" go-mode)
            (rust-mode "Rust Mode" rust-mode)
            (python-mode "Python Mode" python-mode)))
         (active-modes
          (delq nil
                (mapcar (lambda (mode)
                          (let ((mode-var (car mode))
                                (mode-name (cadr mode))
                                (mode-fn (nth 2 mode)))
                            (when (and (boundp mode-var) (symbol-value mode-var))
                              (propertize mode-name
                                          'mouse-face 'mode-line-highlight
                                          'help-echo (format "Click to configure %s" mode-name)
                                          'local-map (let ((map (make-sparse-keymap)))
                                                       (define-key map [mode-line down-mouse-1]
                                                         `(lambda () (interactive)
                                                            (call-interactively ',mode-fn)))
                                                       map)))))
                        modes))))
    (if active-modes
        (string-join active-modes " | ")
      "No active modes")))

(setq-default mode-line-format
              '((:eval (custom-evil-mode-indicator))
                " | "
                (:eval (custom-buffer-name))
                " | "
                (:eval (custom-line-number))
                " | "
                (:eval (custom-mode-indicators))))
#+end_src
