home/dotfiles/.config/emacs/init.el
(require 'package)
(add-to-list 'package-archives '("gnu" . "https://elpa.gnu.org/packages/") t)
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)

(add-to-list 'load-path "/usr/share/emacs/site-lisp")
(add-to-list 'load-path "~/.config/emacs/site-lisp")

(setq inhibit-startup-screen t)   ;; Disable the welcome screen
(tool-bar-mode -1)   	            ;; Disable the toolbar
(menu-bar-mode -1)                ;; Disable the menu bar
(scroll-bar-mode -1)              ;; Disable visible scrollbar

;; Remember recently edited files. Can then be shown with recentf-open-files
(recentf-mode 1)

;; Save what you enter into minibuffer prompts
(setq history-length 25)
(savehist-mode 1)

;; Remember and restore the last cursor location of opened files
(save-place-mode 1)

;; show relative line numbers
(menu-bar--display-line-numbers-mode-relative)

;; automatically close brackets
(electric-pair-mode 1)

;; disable sound
(setq ring-bell-function 'ignore)

;; (require 'nomispaz)

(global-set-key (kbd "C-+") 'text-scale-increase)                ;; zoom in
   (global-set-key (kbd "C--") 'text-scale-decrease)                ;; zoom out
   (global-set-key (kbd "<C-wheel-up>") 'text-scale-increase)       ;; zoom in with mouse wheel
   (global-set-key (kbd "<C-wheel-down>") 'text-scale-decrease)     ;; zoom out with mouse wheel
 ;;copy link anker to clipboard, insert with C-c C-l
 (global-set-key (kbd "C-c l") 'org-store-link)
 ;; duplicate current line
;; first unbind the C-, map in orgmode, then redefine the keymap
 (with-eval-after-load 'org
    (define-key org-mode-map (kbd "C-,") nil))

 (global-set-key (kbd "C-,") 'duplicate-line)

(require 'desktop)
  (desktop-save-mode 1)
   ;; don't save the following buffers
   (add-to-list 'desktop-modes-not-to-save 'dired-mode)
   (add-to-list 'desktop-modes-not-to-save 'Info-mode)
   (add-to-list 'desktop-modes-not-to-save 'info-lookup-mode)
   (add-to-list 'desktop-modes-not-to-save 'fundamental-mode)
   ;; specify dir to save session
   (setq desktop-dirname "~/.local/share/emacs/emacs_session_backup")
   (setq desktop-base-file-name "desktop")
   (setq desktop-base-lock-name "desktop.lock")

(set-face-attribute 'default nil :font "DejaVu Sans Mono" :height 180)
(set-face-attribute 'fixed-pitch nil :font "DejaVu Sans Mono" :height 180)
(set-face-attribute 'variable-pitch nil :font "DejaVu Sans" :height 180)

(set-face-attribute 'mouse nil :background "white")

(require 'catppuccin-theme)
(load-theme 'catppuccin :no-confirm)
