home/dotfiles/.config/emacs/README.org
** Custom modeline
#+begin_src emacs-lisp :tangle ~/.config/emacs/init.el
;; Define a helper function to display a popup menu with all commands for a mode
(defun my/display-mode-menu (mode)
  "Display a popup menu with all commands available for MODE."
  (let ((mode-map (symbol-function mode)))
    (if (keymapp mode-map)
        (popup-menu
         (easy-menu-create-menu
          (symbol-name mode)
          (cl-loop for key in (cdr mode-map)
                   for binding = (cdr key)
                   when (commandp binding)
                   collect (vector (symbol-name binding) binding))))
      (message "No command menu available for %s" (symbol-name mode)))))

;; Helper function to make clickable modeline text with a popup menu
(defun my/modeline-menu-clickable (text mode)
  "Return TEXT with MODE set as a clickable action to show the mode's commands in the mode line."
  (propertize text 'mouse-face 'mode-line-highlight
              'help-echo (concat "Click to see commands for " (symbol-name mode))
              'local-map (let ((map (make-sparse-keymap)))
                           ;; Use a dynamically created function to avoid lexical binding
                           (define-key map [mode-line mouse-1]
                             `(lambda () (interactive) (my/display-mode-menu ',mode)))
                           map)))

;; Define a custom modeline
(defun my/custom-evil-mode-line-indicator ()
  "Return a string for the current Evil mode state."
  (cond
   ((evil-normal-state-p) "N")
   ((evil-visual-state-p) "V")
   ((evil-insert-state-p) "I")
   (t "-")))

(setq-default mode-line-format
              '((:eval (concat
                        " "
                        ;; Evil mode indicator
                        (my/custom-evil-mode-line-indicator)
                        " "

                        ;; Buffer name
                        "%b "
                        
                        ;; Line number
                        "L%l "
                        
                        ;; Yasnippet
                        (when (bound-and-true-p yas-minor-mode)
                          (my/modeline-menu-clickable " Yas " 'yas-minor-mode))
                        
                        ;; Flymake
                        (when (bound-and-true-p flymake-mode)
                          (my/modeline-menu-clickable " Flymake " 'flymake-mode))

                        ;; Go mode
                        (when (derived-mode-p 'go-mode)
                          (my/modeline-menu-clickable " Go " 'go-mode))

                        ;; Rust mode
                        (when (derived-mode-p 'rust-mode)
                          (my/modeline-menu-clickable " Rust " 'rust-mode))

                        ;; Python mode
                        (when (derived-mode-p 'python-mode)
                          (my/modeline-menu-clickable " Python " 'python-mode))))))

#+end_src
*** Doom-modeline
Nice modeline with integration of eglot, flymake and most modes. Currently disabled in favor of my custom modeline
#+BEGIN_SRC emacs-lisp :tangle no
  (use-package doom-modeline
        :ensure t
        :init (doom-modeline-mode 1))
#+END_SRC
*** Nerd-icons
To actually install the fonts, M-x nerd-icons-install-fonts needs to be run
#+begin_src emacs-lisp :tangle no
(use-package nerd-icons
  :ensure t)
#+end_src

* Completion
** Minibuffer
*** Without plugins
These settings are available in vanilla emacs and are alike plugins vertico+orderless (orderless would add regex autosuggestions in minibuffer).
#+begin_src emacs-lisp :tangle ~/.config/emacs/init.el
  ;; display completions in one column in minibuffer
  (setq completions-format 'one-column)
  ;; disable header for completions (shown number of possible completions)
  (setq completions-header-format nil)
  ;; disables case-sensitivity for minibuffer searches
  (setq completion-ignore-case t)
  (setq read-file-name-completion-ignore-case t)
  (setq read-buffer-completion-ignore-case t)

  (setq completion-auto-wrap t
      completion-auto-help nil
      completions-max-height 15
      completion-styles '(basic flex)
      icomplete-in-buffer t
      max-mini-window-height 10)
  
  (fido-vertical-mode 1)
#+end_src
*** Vertico
If the standard display should not be enough, vertico could be used instead (vertical layout of suggestions). 
#+begin_src emacs-lisp :tangle no
  (use-package vertico
    :ensure t
    :config
      (setq vertico-cycle t)
      (setq vertico-resize nil)
      (vertico-mode 1)
  )
#+end_src
*** Orderless
Adds an orderless completion style (regex) if flex style should not be enough.
#+begin_src emacs-lisp :tangle no
  (use-package orderless
    :ensure t
    :config
      (setq completion-styles '(orderless basic))
  )
#+end_src
*** Marginalia
Adds doc string to functions displayed in the minibuffer. No alternative in standard available.
#+begin_src emacs-lisp :tangle no
  (use-package marginalia
    :ensure t
    :config
      (marginalia-mode 1)
  )
#+end_src
** Autosuggestions
*** yasnippets
#+BEGIN_SRC emacs-lisp :tangle ~/.config/emacs/init.el
  (require 'yasnippet)
  (require 'yasnippet-snippets)
  (yas-global-mode 1)
#+END_SRC
** Company
Enable integration of snippets with suggestions as popup in text instead of completion at point.
Without this function, for snippet expansion, TAB can be used and for symbol completion M-C-i with M-arrow and M-Enter to go through suggestions and select one
#+BEGIN_SRC emacs-lisp :tangle ~/.config/emacs/init.el
       ; Enable company-mode with language server support
       (require 'company)
         (setq company-minimum-prefix-length 2)
       (add-hook 'after-init-hook 'global-company-mode)
   (setq company-backends '(company-capf company-yasnippet company-files))
#+END_SRC
* Consult
Allows searching for files and within files via grep and ripgrep.
Alternatives are the vanilla functions
- C-x C-f: find files
- C-x p f: find files in project
- C-x p g: find via grep in project
- C-x p p: change project (i.e. change directory)
- recentf-open-files: open recent files
#+begin_src emacs-lisp :tangle ~/.config/emacs/init.el
  (require 'consult)
 (setq recentf-mode 1)
#+end_src
* LSP
** eglot
Enable breadcrumb from site-lisp folder to enable the breadcrumb feature.
In addition, ensure that yasnippets are used in eglot
#+begin_src emacs-lisp :tangle ~/.config/emacs/init.el
  (require 'eglot)
  (require 'breadcrumb)
(defun add-yasnippet
    ()
    (setq company-backends '((company-capf :with company-yasnippet))))
(add-hook 'eglot--managed-mode-hook #'add-yasnippet)
#+end_src
** Install treesitter languages
#+begin_src emacs-lisp :tangle ~/.config/emacs/init.el
  ; tree-sitter setup languages
    (setq treesit-language-source-alist
          '((go "https://github.com/tree-sitter/tree-sitter-go")
            (rust "https://github.com/tree-sitter/tree-sitter-rust"))
          )
(defun my/install-treesit_languages()
 (interactive)
 (mapc #'treesit-install-language-grammar (mapcar #'car treesit-language-source-alist))
 )
#+end_src
** Language specifics
*** go mode
#+BEGIN_SRC emacs-lisp :tangle ~/.config/emacs/init.el
  ; Enable lsp-mode for Go and Rust modes
  (require 'go-mode)
    (setq indent-tabs-mode nil)
    (setq go-announce-deprecations t)
    (setq go-mode-treesitter-derive t)

  (add-hook 'go-mode-hook 'eglot-ensure)
  (add-hook 'go-mode-hook 'yas-minor-mode)
  (add-hook 'go-mode-hook 'breadcrumb-local-mode)
#+END_SRC
*** rust mode
#+BEGIN_SRC emacs-lisp :tangle ~/.config/emacs/init.el
   (require 'rust-mode)
  (setq indent-tabs-mode nil)
   (setq rust-mode-treesitter-derive t)
  
  (add-hook 'rust-mode-hook 'eglot-ensure)
  (add-hook 'rust-mode-hook
    (lambda () (setq indent-tabs-mode nil)))  
  (add-hook 'rust-mode-hook 'yas-minor-mode)
  (add-hook 'rust-mode-hook 'breadcrumb-local-mode)
  (setq rust-format-on-save t)
#+END_SRC
*** nix
#+BEGIN_SRC emacs-lisp :tangle ~/.config/emacs/init.el
  (require 'nix-mode)
#+END_SRC
* Orgmode and org agenda
#+begin_src emacs-lisp :tangle ~/.config/emacs/init.el
  (require 'org)
  (require 'org-agenda)

  ;; replace "..." at the end of collapsed headlines
  (setq org-ellipsis " ▾"
  ;; remove special characters used for bold, kursiv etc.
  org-hide-emphasis-markers t)

  (setq org-agenda-start-with-log-mode t)
  (setq org-log-done 'time)
  (setq org-log-into-drawer t)
  ;; RETURN will follow links in org-mode files
  (setq org-return-follows-link  t)  
  
  (add-hook 'org-mode-hook 'my/org-mode-setup())
  (add-hook 'org-mode-hook 'my/org-font-setup())

  ;; folder for org-agenda
  ;,(setq org-agenda-files (directory-files-recursively "/mnt/nvme2/data/orgmode" "\\.org$"))
#+end_src
