home/dotfiles/.config/emacs/README.org
* Custom functions
Set options for every Orgfile. Like
- automatic indentation
- set variable font size for better readable text
- automatically perform line wrap
#+begin_src emacs-lisp :tangle ~/.config/emacs/init.el
  (defun my/org-mode-setup()
    ;; active automatic indentation
    (org-indent-mode 1)
    ;; proportially resize font
    (variable-pitch-mode 1)
    ;; automatically perform line wrap
    (visual-line-mode 1)
  )
    (defun my/org-font-setup()
    ;; Replace list hyphen with dot
    (font-lock-add-keywords 'org-mode
                            '(("^ *\\([-]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

    ;;Set faces for heading levels.
    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.1)
                    (org-level-4 . 1.1)
                    (org-level-5 . 1.0)
                    (org-level-6 . 1.0)
                    (org-level-7 . 1.0)
                    (org-level-8 . 1.0)))
  (set-face-attribute (car face) nil :font "DejaVu Sans" :weight 'regular :height (cdr face)))
  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)
    )
#+end_src

* Evil-mode
Use evil collection for better integration of vim keybindings in various modes.
Evil-collection is disabled for now since it is not available in ELPA.

Instead of evil-mode maybe use viper mode that alread emulates vi-keybindings.

#+begin_src emacs-lisp :tangle ~/.config/emacs/init.el
    (require 'evil)
     (setq evil-want-integration t)
      (setq evil-want-keybinding nil)
      (evil-mode 1)

  (evil-set-undo-system 'undo-redo)

    ;;(use-package evil-collection
    ;;  :after evil
    ;;  :ensure t
    ;;  :config
    ;;  (evil-collection-init))

  ;; Using RETURN to follow links in Org/Evil 
  ;; Unmap keys in 'evil-maps if not done, (setq org-return-follows-link t) will not work
  (with-eval-after-load 'evil-maps
    (define-key evil-motion-state-map (kbd "SPC") nil)
    (define-key evil-motion-state-map (kbd "RET") nil)
    (define-key evil-motion-state-map (kbd "TAB") nil))
  ;; Setting RETURN key in org-mode to follow links
    (setq org-return-follows-link  t)
#+end_src

** Additional evil keybindings
#+begin_src emacs-lisp :tangle ~/.config/emacs/init.el
       ;; set leader key in all states
       (evil-set-leader 'normal (kbd "SPC"))
       (evil-set-leader nil (kbd "SPC"))

       ;; set local leader
       (evil-set-leader 'normal "," t)

      ;; window navigation
        (define-key evil-normal-state-map (kbd "C-w <right>") '("Change to right window" . evil-window-right))
        (define-key evil-normal-state-map (kbd "C-w <left>") '("Change to left window" . evil-window-left))
       (define-key evil-normal-state-map (kbd "C-w <up>") '("Change to upper window" . evil-window-top))
       (define-key evil-normal-state-map (kbd "C-w <down>") '("Change to bottom window" . evil-window-down))
        (define-key evil-normal-state-map (kbd "C-w k") '("Close window" . evil-window-delete)) 
      ;; files
       (define-key evil-normal-state-map (kbd "<leader> f f") '("Search files" . consult-find))
       (define-key evil-normal-state-map (kbd "<leader> f r") '("Recent files" . recentf))
       (define-key evil-normal-state-map (kbd "<leader> f g") '("Search files (grep)" . consult-grep))
       (define-key evil-normal-state-map (kbd "<leader> f n") '("New file" . evil-buffer-new))

       ;; buffers
       (define-key evil-normal-state-map (kbd "<leader> b b") '("Switch to buffer" . switch-to-buffer))
       (define-key evil-normal-state-map (kbd "<leader> b k") '("Kill current buffer" . kill-current-buffer))
       (define-key evil-normal-state-map (kbd "<leader> b r") '("Rename buffer" . rename-buffer))
       (define-key evil-normal-state-map (kbd "<leader> b s") '("Save buffer" . basic-save-buffer))

       ;; tabs
       (define-key evil-normal-state-map (kbd "<leader> t t") '("Switch to tab" . tab-switch))

       ;; search
       (define-key evil-normal-state-map (kbd "<leader> s o") '("Search heading" - consult-outline))
       (define-key evil-normal-state-map (kbd "<leader> s l") '("Search line" . consult-line))

       ;; org-mode
       (define-key evil-normal-state-map (kbd "<leader> o e") '("Export org file" . org-export-dispatch))
        (define-key evil-normal-state-map (kbd "<leader> o a") '("Open org agenda" . org-agenda))
       (define-key evil-normal-state-map (kbd "<leader> o t") '("Export code blocks" . org-babel-tangle))
       (define-key evil-normal-state-map (kbd "<leader> o i s") '("Insert scheduled date" . org-schedule))

       ;; flycheck
       (define-key evil-normal-state-map (kbd "<leader> l l") '("Show list of flycheck errors" . flymake-show-buffer-diagnostics))
       (define-key evil-normal-state-map (kbd "<leader> l n") '("Next flycheck error" . flymake-goto-next-error))
       (define-key evil-normal-state-map (kbd "<leader> l p") '("Previous flycheck error" . flymake-goto-previous-error))

      ;; lsp
       (define-key evil-normal-state-map (kbd "<leader> g r n") '("Rename variable or function" . eglot-rename))
    (define-key evil-normal-state-map (kbd "<leader> g d") '("LSP goto definition" . xref-find-definitions))
    (define-key evil-normal-state-map (kbd "<leader> g D") '("LSP Find references" . xref-find-references))
    (define-key evil-normal-state-map (kbd "K") '("LSP show doc in buffer" . eldoc))
    (define-key evil-normal-state-map (kbd "C-.") '("LSP execute code action" . eglot-code-actions))
#+end_src
